nxp-mcuxpresso/mcuxsdk-examples/_boards/mimxrt700evk/multiprocessor_examples/erpc_server_matrix_multiply_spi/cm33_core0/pin_mux.c
/*
 * Copyright 2024-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMXRT798S
package_id: MIMXRT798SGFOB
mcu_data: ksdk2_0
processor_version: 25.03.10
pin_labels:
- {pin_num: N4, pin_signal: PIO0_31/LP_FLEXCOMM0_P0/UTICK0_CAP2/SCT0_OUT8/CTIMER4_MAT0, label: GPIO_BRIDGE, identifier: GPIO_BRIDGE}
- {pin_num: R1, pin_signal: PIO1_12/LP_FLEXCOMM2_P1/SCT0_GPIN3/SCT0_OUT9/CTIMER1_MAT1/SWD_TRACEDATA1, label: GPIO_BRIDGE, identifier: GPIO_BRIDGE}
- {pin_num: R2, pin_signal: PIO1_11/LP_FLEXCOMM2_P0/CTIMER2_MAT2/SWD_TRACEDATA0, label: GPIO_BRIDGE, identifier: GPIO_BRIDGE}
- {pin_num: R5, pin_signal: PIO1_18/LP_FLEXCOMM3_P0/USB0_PORTPWRN/CTIMER4_MAT0/I3C0_SDA, label: GPIO_BRIDGE, identifier: GPIO_BRIDGE2;GPIO_BRIDGE}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: E1, peripheral: LPSPI14, signal: SOUT, pin_signal: PIO3_0/LPSPI14_SOUT/EZH_PIO16, input_buffer: enable}
  - {pin_num: E2, peripheral: LPSPI14, signal: SCK, pin_signal: PIO3_1/LPSPI14_SCK/EZH_PIO17, input_buffer: enable}
  - {pin_num: D2, peripheral: LPSPI14, signal: SIN, pin_signal: PIO3_2/LPSPI14_SIN/EZH_PIO18, input_buffer: enable}
  - {pin_num: C3, peripheral: LPSPI14, signal: PCS0, pin_signal: PIO3_3/LPSPI14_PCS0/EZH_PIO19, input_buffer: enable}
  - {pin_num: R5, peripheral: GPIO1, signal: 'GPIO, 18', pin_signal: PIO1_18/LP_FLEXCOMM3_P0/USB0_PORTPWRN/CTIMER4_MAT0/I3C0_SDA, identifier: GPIO_BRIDGE, direction: OUTPUT,
    gpio_init_state: 'false'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t GPIO_BRIDGE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_18 (pin R5)  */
    GPIO_PinInit(BOARD_INITPINS_GPIO_BRIDGE_GPIO, BOARD_INITPINS_GPIO_BRIDGE_PIN, &GPIO_BRIDGE_config);
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t GPIO_BRIDGE = (/* Pin is configured as PIO1_18 */
                                  IOPCTL_PIO_FUNC0 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Disable input buffer function */
                                  IOPCTL_PIO_INBUF_DI |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN18 (coords: R5) is configured as PIO1_18 */
    IOPCTL_PinMuxSet(BOARD_INITPINS_GPIO_BRIDGE_PORT, BOARD_INITPINS_GPIO_BRIDGE_PIN, GPIO_BRIDGE);

    const uint32_t port3_pin0_config = (/* Pin is configured as LPSPI14_SOUT */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT3 PIN0 (coords: E1) is configured as LPSPI14_SOUT */
    IOPCTL_PinMuxSet(3U, 0U, port3_pin0_config);

    const uint32_t port3_pin1_config = (/* Pin is configured as LPSPI14_SCK */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT3 PIN1 (coords: E2) is configured as LPSPI14_SCK */
    IOPCTL_PinMuxSet(3U, 1U, port3_pin1_config);

    const uint32_t port3_pin2_config = (/* Pin is configured as LPSPI14_SIN */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT3 PIN2 (coords: D2) is configured as LPSPI14_SIN */
    IOPCTL_PinMuxSet(3U, 2U, port3_pin2_config);

    const uint32_t port3_pin3_config = (/* Pin is configured as LPSPI14_PCS0 */
                                        IOPCTL_PIO_FUNC1 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT3 PIN3 (coords: C3) is configured as LPSPI14_PCS0 */
    IOPCTL_PinMuxSet(3U, 3U, port3_pin3_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
